---
type: StructuralSectionConcreteRectangleCut
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 5
tags: [revit-api, class]
---

# StructuralSectionConcreteRectangleCut

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionConcreteRectangleCut | 2016 | `public StructuralSectionConcreteRectangleCut ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight` |
| Property | BottomCutHeight | 2016 | `public double BottomCutHeight { get ; set ; }` |
| Property | BottomCutWidth | 2016 | `public double BottomCutWidth { get ; set ; }` |
| Property | TopCutHeight | 2016 | `public double TopCutHeight { get ; set ; }` |
| Property | TopCutWidth | 2016 | `public double TopCutWidth { get ; set ; }` |